<!-- dflook/terraform-github-actions {"workspace":"1-3-4-arm-constraints","backend":"d3823a95f5d2cfbb79fd08f0f73bbec9639ac17dffb1f4482274949d1ad9c9fe","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #283 at https://github.com/dflook/terraform-github-actions/actions/runs/3504722430","plan_hash":"651664f74ff6546f42e5cc02fa96c6c610f2c8f4dc958f4e3141c3b172973fc2","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __1-3-4-arm-constraints__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "Fbh6kIIRD5" -> (known after apply)
  ~ foreach = "bCNJR044om" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #283](https://github.com/dflook/terraform-github-actions/actions/runs/3504722430)